In [2]:
import pandas as pd

In [3]:
#2. OHLC(Open/High/Low/Close) 가격정보 데이터입니다. (OHLC : 시가(open), 고가 (high), 저가 (low) , 종가(close))
data = [[ 2000, 3050, 2050, 1980],
         [ 7500, 2050, 2050, 1980],
           [15450, 15050, 15550, 14900]] 
# (2-01) 데이터를 저장해 주세요.
# 단, 저장 시에 컬럼명을 시가, 고가, 저가, 종가로 설정해서 저장하세요.
DF2=pd.DataFrame(data)
DF2.columns=['시가','고가','저가','종가']
DF2

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [4]:
# (2-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.
print(DF2.index,DF2.values,DF2.columns,DF2.shape,DF2.ndim,DF2.dtypes)

RangeIndex(start=0, stop=3, step=1) [[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]] Index(['시가', '고가', '저가', '종가'], dtype='object') (3, 4) 2 시가    int64
고가    int64
저가    int64
종가    int64
dtype: object

In [5]:
# (2-03) 행 인덱스를 2024-01-01, 2024-02-01, 2024-03-01 데이터로 변경해 주세요.
DF2.index = ['2024-01-01','2024-02-01','2024-03-01']
DF2

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [6]:
# (2-04) 행 인덱스를 Open/High/Low/Close로 변경해 주세요.
DF2.columns = ['Open', 'High' , 'Low' , 'Close']

In [7]:
# (2-05) 2024-02-01의 High, Close 데이터를 추출 하세요.
DF2.iloc[1, [1, 3]]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [8]:
# (2-06) 2024-04-01의 3200, 3550, 3000, 2990 데이터를 추가해 주세요.
DF2.loc['2024-04-01'] = [3200, 3550, 3000, 2990]
DF2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [9]:
# (2-07) 2024-01-01 데이터를 삭제해 주세요.
DF3 = DF2.drop(index = '2024-01-01')
DF3

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [10]:
# (2-08) 2024-03-01의 Low값을 14000으로 변경해 주세요.
DF3.iloc[2, 2] = 14000
DF3

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550  14000   2990

In [11]:
# (2-09) Average 컬럼을 추가 후 0으로 값을 채워 주세요.
DF3['Average']=0
DF3

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  15550  14900        0
2024-04-01   3200   3550  14000   2990        0

In [12]:
# (2-10) Total행을 추가 후 0으로 값을 채워 주세요.
DF3.loc['Total']=0
DF3

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  15550  14900        0
2024-04-01   3200   3550  14000   2990        0
Total           0      0      0      0        0